Autodesk.Revit.DB.StructDeckEmbeddingType
Used in class CompoundStructure to specify the usage of a layer whose function is StructuralDeck.
Since:
2012

Autodesk.Revit.DB.StructDeckEmbeddingType.Standalone
Standalone deck.

Autodesk.Revit.DB.StructDeckEmbeddingType.MergeWithLayerAbove
Bound layer above.

Autodesk.Revit.DB.StructDeckEmbeddingType.Invalid
Invalid usage.